<a href="https://colab.research.google.com/github/Harikaharu/DataScience/blob/main/pandas/pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
lst=[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
arr=np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
pd.Series(index=["Eshant","rohit","jayesh","ashish"],data=[50,70,50,56])

Eshant    50
rohit     70
jayesh    50
ashish    56
dtype: int64

In [5]:
steps={'day1':4000,'day2':3000,'day3':12000}
pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

In [6]:
pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

In [7]:
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

In [8]:
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [9]:
s[4]

np.int64(10)

In [10]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

In [11]:

sr=pd.Series([10,20,30,40,50,60,70])
sr.agg([min,max,sum])

/tmp/ipython-input-11-2362577946.py:2: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
/tmp/ipython-input-11-2362577946.py:2: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
/tmp/ipython-input-11-2362577946.py:2: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     10
max     70
sum    280
dtype: int64

In [12]:
sr = pd.Series([1,-2,3,-4,5,-6,7])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [13]:
sr1 = pd.Series([1,-2,3])
sr2 = pd.Series([1,2,3])
sr3 = pd.concat([sr1,sr2])
sr3

0    1
1   -2
2    3
0    1
1    2
2    3
dtype: int64

In [14]:
ser=pd.Series(["  Eshant Das   ","Data Science","Narendar"])
print(ser.str.upper())
print('-'*30)
print(ser.str.lower())

0      ESHANT DAS
1       DATA SCIENCE
2           NARENDAR
dtype: object
------------------------------
0      eshant das
1       data science
2           narendar
dtype: object

In [15]:
for i in ser:
  print(len(i))

15
12
8

In [16]:
ser=ser.str.strip()
for i in ser:
  print(i,len(i))

Eshant Das 10
Data Science 12
Narendar 8

In [17]:
ser=pd.Series(["Eshant Das","Data Science","Narendar","train the  trainer"])
ser.str.split()

0            [Eshant, Das]
1          [Data, Science]
2               [Narendar]
3    [train, the, trainer]
dtype: object

In [18]:
ser.str.split()[0]

['Eshant', 'Das']

In [19]:
ser = pd.Series(["Eshant Das","Data@Science",'Hello@World','Machine Learning'])
ser.str.contains('@')

0    False
1     True
2     True
3    False
dtype: bool

In [20]:
ser.str.replace('@',' ')

0          Eshant Das
1        Data Science
2         Hello World
3    Machine Learning
dtype: object

In [21]:
ser.str.count('a')

0    2
1    2
2    0
3    2
dtype: int64

In [22]:
ser.str.startswith('D')

0    False
1     True
2    False
3    False
dtype: bool

In [23]:
ser.str.endswith('s')

0     True
1    False
2    False
3    False
dtype: bool

In [24]:
ser.str.find('Data')

0   -1
1    0
2   -1
3   -1
dtype: int64